## Step 1: Validate the files

This data set is provided by Kaggle as part of the `Titanic: Machine Learning from Disaster!` challenge.
I have already downloaded the data, and it can be found in the `./kaggle/input/titanic` dir associated with this notebook.

In [25]:
import os

data_dir = "kaggle/input/titanic/"
if not os.path.exists(data_dir):
    os.makedirs(data_dir)

In [26]:
[f"{kaggle_input_dir}{file}" for file in os.listdir(kaggle_input_dir)]

['kaggle/input/titanic/gender_submission.csv',
 'kaggle/input/titanic/train.csv',
 'kaggle/input/titanic/test.csv']

## Step 2: Explore the data

Let's first import some of the packages we'll need, then we can explore our data sets.

In [28]:
import time
from time import gmtime, strftime

import numpy as np
import pandas as pd

import matplotlib.pyplot as plt

import sklearn.model_selection

In [31]:
train = pd.read_csv(os.path.join(data_dir, 'train.csv'), header=None)
test = pd.read_csv(os.path.join(data_dir, 'test.csv'), header=None)

In [33]:
train.head(10)

,0,1,2,3,4,5,6,7,8,9,10,11
0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,NaN,S
2,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,NaN,S
4,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S
5,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,NaN,S
6,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S
8,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.075,NaN,S
9,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,NaN,S

In [35]:
test.head(10)

,0,1,2,3,4,5,6,7,8,9,10
0,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
2,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47,1,0,363272,7,NaN,S
3,894,2,"Myles, Mr. Thomas Francis",male,62,0,0,240276,9.6875,NaN,Q
4,895,3,"Wirz, Mr. Albert",male,27,0,0,315154,8.6625,NaN,S
5,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22,1,1,3101298,12.2875,NaN,S
6,897,3,"Svensson, Mr. Johan Cervin",male,14,0,0,7538,9.225,NaN,S
7,898,3,"Connolly, Miss. Kate",female,30,0,0,330972,7.6292,NaN,Q
8,899,2,"Caldwell, Mr. Albert Francis",male,26,1,1,248738,29,NaN,S
9,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18,0,0,2657,7.2292,NaN,C

We can already see that the data is organized very well, and there are some obvious features we can work with, such as `Age`, `Sex`, and `Pclass` (ticket class), `sibsp` (# of siblings / spouses aboard the Titanic), and `parch` (# of parents / children aboard the Titanic).

Other features like `Name`, might prove to be less important.

We also see our `Classifier` labeled here as `Survived`. This is obviously missing from the test set.

We can aso engineer some new features from this data, for instance; We can create a `child` feature based on age, as well as an `senior` feature.